In [21]:
import pandas as pd

In [42]:
df = pd.read_excel('people.xlsx')
df

    Name  Test1  Test2  Test3
0    Bob     35     65     88
1   Sara     85     78     92
2  Susan     55     67     79

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
Name     3 non-null object
Test1    3 non-null int64
Test2    3 non-null int64
Test3    3 non-null int64
dtypes: int64(3), object(1)
memory usage: 176.0+ bytes

In [44]:
df.isna().sum()

Name     0
Test1    0
Test2    0
Test3    0
dtype: int64

In [45]:
df.describe().T

       count       mean        std   min   25%   50%   75%   max
Test1    3.0  58.333333  25.166115  35.0  45.0  55.0  70.0  85.0
Test2    3.0  70.000000   7.000000  65.0  66.0  67.0  72.5  78.0
Test3    3.0  86.333333   6.658328  79.0  83.5  88.0  90.0  92.0

In [46]:
df = df.set_index('Name')
df

       Test1  Test2  Test3
Name
Bob       35     65     88
Sara      85     78     92
Susan     55     67     79

In [47]:
df['average'] = df.mean(axis=1)
df

       Test1  Test2  Test3    average
Name
Bob       35     65     88  62.666667
Sara      85     78     92  85.000000
Susan     55     67     79  67.000000

In [48]:
df['passed'] = df.average > 80
df

       Test1  Test2  Test3    average  passed
Name
Bob       35     65     88  62.666667   False
Sara      85     78     92  85.000000    True
Susan     55     67     79  67.000000   False

In [59]:
' and '.join(df[~df.passed].index.tolist()) + ' failed chemistry class.'

'Bob and Susan failed chemistry class.'